app/controllers/texts_controller.rb

SELECT "texts".* FROM "texts"
---
  def index
    @texts = Text.all

INSERT INTO "texts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2015-11-18 04:29:12.924539"], ["updated_at", "2015-11-18 04:29:12.924539"]]
---
  def create
    @text = Text.new(text_params)

    respond_to do |format|
      if @text.save

SELECT  "texts".* FROM "texts" WHERE "texts"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_text
      @text = Text.find(params[:id])